; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v3 - type_3 ?v7 - type_1)
 	      (pred_2 ?v1 - object ?v7 - type_1)
	      (pred_4 ?v3 - type_3 ?v6 - type_2)
	      (pred_3 ?v3 - type_3 ?v1 - object ?v6 - type_2))

   (:action op_1
       :parameters  (?v3 - type_3 ?v2 ?v8 - type_1)
       :precondition (and  (pred_1 ?v3 ?v2))
       :effect (and  (pred_1 ?v3 ?v8)
		     (not (pred_1 ?v3 ?v2))))

   (:action op_3
       :parameters (?v3 - type_3 ?v4 - object ?v5 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v4 ?v5) (pred_1 ?v3 ?v5) (pred_4 ?v3 ?v6))
       :effect (and (pred_3 ?v3 ?v4 ?v6)
		    (not (pred_2 ?v4 ?v5)) 
		    (not (pred_4 ?v3 ?v6))))

   (:action op_2
       :parameters (?v3 - type_3 ?v4 - object ?v5 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v4 ?v6) (pred_1 ?v3 ?v5))
       :effect (and (pred_2 ?v4 ?v5)
		    (pred_4 ?v3 ?v6)
		    (not (pred_3 ?v3 ?v4 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_01 - type_3
obj_09 obj_13 obj_08 obj_04 - type_2
obj_11 obj_07 obj_10 obj_06 - type_1
obj_03 obj_02 obj_05 - object)
(:init
(pred_1 obj_12 obj_11)
(pred_4 obj_12 obj_09)
(pred_4 obj_12 obj_13)
(pred_1 obj_01 obj_06)
(pred_4 obj_01 obj_08)
(pred_4 obj_01 obj_04)
(pred_2 obj_03 obj_11)
(pred_2 obj_02 obj_07)
(pred_2 obj_05 obj_11)
)
(:goal
(and
(pred_2 obj_03 obj_11)
(pred_2 obj_02 obj_10)
(pred_2 obj_05 obj_10)
)
)

(:constraints
  (always (not (pred_1 obj_12 obj_10)))
)
)

; plan
1. (op_3 obj_12 obj_05 obj_11 obj_13)
   deleted: (pred_2 obj_05 obj_11) (pred_4 obj_12 obj_13)
   added: (pred_3 obj_12 obj_05 obj_13)
   goals met: 1 of 3
2. (op_1 obj_01 obj_06 obj_11)
   deleted: (pred_1 obj_01 obj_06)
   added: (pred_1 obj_01 obj_11)
   goals met: 1 of 3
3. (op_1 obj_12 obj_11 obj_07)
   deleted: (pred_1 obj_12 obj_11)
   added: (pred_1 obj_12 obj_07)
   goals met: 1 of 3
4. (op_1 obj_01 obj_11 obj_07)
   deleted: (pred_1 obj_01 obj_11)
   added: (pred_1 obj_01 obj_07)
   goals met: 1 of 3
5. (op_3 obj_01 obj_02 obj_07 obj_04)
   deleted: (pred_2 obj_02 obj_07) (pred_4 obj_01 obj_04)
   added: (pred_3 obj_01 obj_02 obj_04)
   goals met: 1 of 3
6. (op_2 obj_12 obj_05 obj_07 obj_13)
   deleted: (pred_3 obj_12 obj_05 obj_13)
   added: (pred_2 obj_05 obj_07) (pred_4 obj_12 obj_13)
   goals met: 1 of 3
7. (op_1 obj_01 obj_07 obj_10)
   deleted: (pred_1 obj_01 obj_07)
   added: (pred_1 obj_01 obj_10)
   goals met: 1 of 3
8. (op_2 obj_01 obj_02 obj_10 obj_04)
   deleted: (pred_3 obj_01 obj_02 obj_04)
   added: (pred_2 obj_02 obj_10) (pred_4 obj_01 obj_04)
   goals met: 2 of 3
9. (op_1 obj_01 obj_10 obj_07)
   deleted: (pred_1 obj_01 obj_10)
   added: (pred_1 obj_01 obj_07)
   goals met: 2 of 3
10. (op_3 obj_01 obj_05 obj_07 obj_04)
   deleted: (pred_2 obj_05 obj_07) (pred_4 obj_01 obj_04)
   added: (pred_3 obj_01 obj_05 obj_04)
   goals met: 2 of 3
11. (op_1 obj_01 obj_07 obj_10)
   deleted: (pred_1 obj_01 obj_07)
   added: (pred_1 obj_01 obj_10)
   goals met: 2 of 3
12. (op_2 obj_01 obj_05 obj_10 obj_04)
   deleted: (pred_3 obj_01 obj_05 obj_04)
   added: (pred_2 obj_05 obj_10) (pred_4 obj_01 obj_04)
   goals met: 3 of 3
